// (1）开门：
// 开加戊：财名俱得。开加乙：小财可求。开加丙：贵人印绶。开加丁：远信必至。开加已：事绪不定。
// 开加庚：道路词讼，谋为两岐。
// 开加辛：阴人道路。
// 开加壬：远行有失，注意破财。
// 开加癸：阴人失财小凶。

// （2）休门：
// 休加戊：财物和合。
// 休加乙：求谋重，不得；求轻，可得。
// 休加丙：文书和合喜庆。
// 休加丁：百讼休歇。
// 休加己：暗昧不宁，后吉。休加庚：文书词讼先结后解。休加辛：疾病迟愈，失物不得。休加壬、癸：阴人词讼牵连。

//(3）生门:
// 生加丙：主贵人印绶、婚姻、书信喜事。
// 生加丁：主词讼、婚姻、财利大吉。
// 生加己：主得贵人维持，吉。
// 生加庚：主财产争讼破产，不利。
// 生加辛：主产妇疾病，后吉。
// 生加壬：主遗失财后得，贼盗易获。生加癸：主婚姻不成，余事皆吉。

//(4）伤门:
// 伤加戊：主失脱难获。
// 伤加乙：主求谋不得，反防盗失财。
// 伤加丙：主道路损失。
// 伤加丁：主音信不至。
// 伤加己：主财散人病。
// 伤加庚：主讼狱被刑杖，凶。
// 伤加辛：主夫妻怀私恣怨。
// 伤加壬：主因盗牵连。
// 伤加癸：主讼狱被冤，有理难伸。

// (5）杜门：
// 杜加戊：主谋事不成，秘处求财得。
// 杜加乙：宜暗求男人财物，后主不明致讼。
// 杜加丙：主文契遗失。
// 杜加丁：主男人讼狱。
// 杜加己：主私谋害人招非。
// 杜加庚：主因女人讼狱被刑。
// 杜加辛：主打伤人，词讼，男人小口凶。
// 杜加壬：主奸盗事，凶。
// 杜加癸：主百事皆阻，病者不食。

// (6）景门：
// 景加丙：主文书急迫，火速不利。
// 景加丁：主因文书印状招非。
// 景加己：主官司牵连。景加庚：主讼人自讼。景加辛：主阴人词讼。景加壬：主因贼牵连。
// 景加癸：主因奴婢受刑。